//
//  PrivacyPolicyView.swift
//  Whistle
//
//  Created by ChoiYujin on 9/20/23.
//

import MarkdownUI
import SwiftUI

// MARK: - PrivacyPolicyView

struct PrivacyPolicyView: View {

  var body: some View {
    ScrollView {
      VStack {
        Markdown {
          """
          < 더뉴컴퍼니 >('https://readywhistle.com/' 이하 'Whistle')*은(는) 「개인정보 보호법」 제30조에 따라 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과 같이 개인정보 처리방침을 수립·공개합니다.

          ○ 이 개인정보처리방침은 *2023*년 *9*월 *20*부터 적용됩니다.

          **제1조(개인정보의 처리 목적)< 더뉴컴퍼니 >('https://readywhistle.com/' 이하  'Whistle') 은(는) 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는 개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며 이용 목적이 변경되는 경우에는 「개인정보 보호법」 제18조에 따라 별도의 동의를 받는 등 필요한 조치를 이행할 예정입니다.**

          1. 홈페이지 회원가입 및 관리
          회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 만14세 미만 아동의 개인정보 처리 시 법정대리인의 동의여부 확인, 각종 고지·통지 목적으로 개인정보를 처리합니다.

          2. 민원사무 처리
          민원사항 확인, 처리결과 통보 목적으로 개인정보를 처리합니다.

          3. 재화 또는 서비스 제공
          콘텐츠 제공, 맞춤서비스 제공을 목적으로 개인정보를 처리합니다.

          4. 마케팅 및 광고에의 활용
          신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.

          **제2조(개인정보의 처리 및 보유 기간)**

          ① < 더뉴컴퍼니 > 은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.

          ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

          1.<홈페이지 회원가입 및 관리>

          <홈페이지 회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<탈퇴 후 1년>까지 위 이용목적을 위하여 보유.이용됩니다.

          - 보유근거 : 정보주체 동의
          - 관련법령 : 제 8조 개인정보 안전성 확보 조치
          - 예외사유 : 사용자가 직접 개인정보 그 즉시 폐기를 요구하는 경우

          2.<민원사무 처리>

          <민원사무 처리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<3년>까지 위 이용목적을 위하여 보유.이용됩니다.

          - 보유근거 : 정보주체 동의
          - 관련법령 : 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년

          3.<재화 또는 서비스 제공>

          <재화 또는 서비스 제공>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<3년>까지 위 이용목적을 위하여 보유.이용됩니다.

          - 보유근거 : 정보주체 동의
          - 관련법령 : 1)소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
          2) 개인정보 보호법」제15조 제1항 제1호에 따라 개인정보처리자는 정보주체의 동의를 받아 개인정보를 수집·이용할 수 있음

          4.<마케팅 및 광고에의 활용>

          <마케팅 및 광고에의 활용>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<6개월>까지 위 이용목적을 위하여 보유.이용됩니다.

          - 보유근거 : 정보주체 동의
          - 관련법령 : 표시/광고에 관한 기록 : 6개월

          **제3조(처리하는 개인정보의 항목)**

          ① < 더뉴컴퍼니 >은(는) 다음의 개인정보 항목을 처리하고 있습니다.

          1. < 홈페이지 회원가입 및 관리 >
          - 필수항목 : 로그인ID, 비밀번호, 이메일
          2. < 민원사무 처리 >
          - 필수항목 : 로그인ID, 민원 내용
          3. < 재화 또는 서비스 제공 >
          - 필수항목 : 로그인ID, 접속 로그, 서비스 이용 기록
          4. < 마케팅 및 광고에의 활용 >
          - 필수항목 : 로그인ID, 이메일, 접속 로그, 서비스 이용 기록

          **제4조(개인정보의 파기절차 및 파기방법)**

          < 더뉴컴퍼니 > 은(*는*) 개인정보 보유기간의 경과, 처리목적 달성 등 개인정보가 불필요하게 되었을 때에는 지체없이 해당 개인정보를 파기합니다.

          *1.* 파기절차
          < 더뉴컴퍼니 > 은(는)  파기 사유가 발생한 개인정보를 선정하고, < 더뉴컴퍼니 > 의 개인정보 보호책임자의 승인을 받아 개인정보를 파기합니다.

          *2.* 파기방법

          전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.

          **제5조(미이용자의 개인정보 파기 등에 관한 조치)**

          ① <개인정보처리자명>은(는) 1년간 서비스를 이용하지 않은 이용자는 휴면계정으로 전환하고, 개인정보를 별도로 분리하여 보관합니다. 분리 보관된 개인정보는 1년간 보관 후 지체없이 파기합니다.
          ② <개인정보처리자명>은(는) 휴먼전환 30일 전까지 휴면예정 회원에게 별도 분리 보관되는 사실 및 휴면 예정일, 별도 분리 보관하는 개인정보 항목을 이메일, 문자 등 이용자에게 통지 가능한 방법으로 알리고 있습니다.
          ③ 휴면계정으로 전환을 원하지 않으시는 경우, 휴면계정 전환 전 서비스 로그인을 하시면 됩니다. 또한, 휴면계정으로 전환되었더라도 로그인을 하는 경우 이용자의 동의에 따라 휴면계정을 복원하여 정상적인 서비스를 이용할 수 있습니다.

          **제6조 (정보주체와 법정대리인의 권리·의무 및 그 행사방법에 관한 사항)**

          ① 정보주체는 더뉴컴퍼니에 대해 언제든지 개인정보 열람·정정·삭제·처리정지 요구 등의 권리를 행사할 수 있습니다.

          ② 제1항에 따른 권리 행사는더뉴컴퍼니에 대해 「개인정보 보호법」 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 더뉴컴퍼니은(는) 이에 대해 지체 없이 조치하겠습니다.

          ③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 “개인정보 처리 방법에 관한 고시(제2020-7호)” 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.

          ④ 개인정보 열람 및 처리정지 요구는 「개인정보 보호법」 제35조 제4항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.

          ⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.

          ⑥ 더뉴컴퍼니은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 *열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.

          **제7조(개인정보의 안전성 확보조치에 관한 사항)**
          **< 더뉴컴퍼니 >은(는) 개인정보의 안전성 확보를 위해 다음과 같은 *조치를 취하고 있습니다.**

          *1*. 내부관리계획의 수립 및 시행
          개인정보의 안전한 처리를 위하여 내부관리계획을 수립하고 시행하고 있습니다.
          *2*. 정기적인 자체 감사 실시개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.
          *3*. 개인정보에 대한 접근 제한개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여, 변경, 말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다*.*

          **제8조(개인정보를 자동으로 수집하는 장치의 설치·운영 및 그 거부에 관한 사항)**

          더뉴컴퍼니 은(는) 정보주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키(cookie)’를 사용하지 않습니다.

          **제9조(행태정보의 수집·이용·제공 및 거부 등에 관한 사항)**

          ① <개인정보처리자>은(는) 서비스 이용과정에서 정보주체에게 최적화된 맞춤형 서비스 및 혜택, 온라인 맞춤형 광고 등을 제공하기 위하여 행태정보를 수집·이용하고 있습니다.

          ② <개인정보처리자>은(는) 다음과 같이 행태정보를 수집합니다.

          10. 행태정보의 수집·이용·제공 및 거부 등에 관한 사항 제공을 위해 수집하는 행태정보의 항목, 행태정보 수집 방법, 행태정보 수집 목적, 보유·이용기간 및 이후 정보처리 방법을 입력하기 위한 표입니다.

          | 수집하는 행태정보의 항목 | 행태정보 수집 방법 | 행태정보 수집 목적 | 보유·이용기간 및 이후 정보처리 방법 |
          | --- | --- | --- | --- |
          | 앱 서비스 방문이력 | 앱 다운로드 및 실행시 자동 수집 | 이용자의 관심 및 성향에 기반한 개인 맞춤형 서비스 (광고포함) 제공 | 수집일로부터 1년 후 파기 |

           ③ <개인정보처리자>은(는) 온라인 맞춤형 광고 등에 필요한 최소한의 행태정보만을 수집하며, 사상, 신념, 가족 및 친인척관계, 학력·병력, 기타 사회활동 경력 등 개인의 권리·이익이나 사생활을 뚜렷하게 침해할 우려가 있는 민감한 행태정보를 수집하지 않습니다.

           ④ <개인정보처리자>은(는) 만 14세 미만임을 알고 있는 아동이나 만14세 미만의 아동을 주 이용자로 하는 온라인 서비스로부터 맞춤형 광고 목적의 행태정보를 수집하지 않고, 만 14세 미만임을 알고 있는 아동에게는 맞춤형 광고를 제공하지 않습니다.

          ⑤ <개인정보처리자>은(는) 모바일 앱에서 온라인 맞춤형 광고를 위하여 광고식별자를 수집·이용합니다. 정보주체는 모바일 단말기의 설정 변경을 통해 앱의 맞춤형 광고를 차단·허용할 수 있습니다.

          ‣ 스마트폰의 광고식별자 차단/허용

          (아이폰) ① 설정 → ② 개인정보보호 → ③ 추적 → ④ 앱이 추적을 요청하도록 허용 끔

          ※ 모바일 OS 버전에 따라 메뉴 및 방법이 다소 상이할 수 있습니다.

          **제10조(추가적인 이용·제공 판단기준)**

          < 더뉴컴퍼니 > 은(는) ｢개인정보 보호법｣ 제15조제3항 및 제17조제4항에 따라 ｢개인정보 보호법 시행령｣ 제14조의2에 따른 사항을 고려하여 정보주체의 동의 없이 개인정보를 추가적으로 이용·제공할 수 있습니다. 이에 따라 < 더뉴컴퍼니 > 가(이) 정보주체의 동의 없이 추가적인 이용·제공을 하기 위해서 다음과 같은 사항을 고려하였습니다.

          ▶ 개인정보를 추가적으로 이용·제공하려는 목적이 당초 수집 목적과 관련성이 있는지 여부
          ▶ 개인정보를 수집한 정황 또는 처리 관행에 비추어 볼 때 추가적인 이용·제공에 대한 예측 가능성이 있는지 여부
          ▶ 개인정보의 추가적인 이용·제공이 정보주체의 이익을 부당하게 침해하는지 여부
          ▶ 가명처리 또는 암호화 등 안전성 확보에 필요한 조치를 하였는지 여부
          ※ 추가적인 이용·제공 시 고려사항에 대한 판단기준은 사업자/단체 스스로 자율적으로 판단하여 작성·공개함

          **제11조 (개인정보보호를 위한 기술적·관리적 대책)**

          “회사”는 이용자의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 유출, 변조 또는 훼손되지 않도록 안정성 확보를 위하여 다음과 같은 기술적· 관리적 대책을 강구하고 있습니다.

          ① 기술적 보호 대책

          - 가. 이용자의 개인정보는 비밀번호에 의해 보호되며, 중요한 데이터는 파일 및 전송 데이터를 암호화하거나 파일 잠금기능을 사용하는 등 별도 보안기능을 통해 보호되고 있습니다.
          - 나. 백신 프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 적용함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
          - 다. 네트워크 상의 개인정보 및 개인인증정보를 안전하게 전송할 수 있는 보안장치(SSL)를 채택하고 있습니다.
          - 라. 해킹 등에 의해 고객의 개인정보가 유출되는 것을 방지하기 위하여, 외부 침입을 차단하는 장치를 이용하고 있으며, 침입탐지시스템을 설치하여 24시간 감시하고 있습니다.

          ② 관리적 보호 대책

          - 가. “회사”는 이용자의 개인정보를 처리할 수 있는 자를 최소한으로 제한하고, 별도의 비밀번호를 부여하여 접근 권한을 관리하고 있습니다. 또한 새로운 보안 기술 습득 및 개인정보보호 의무 등에 관해 정기적인 교육을 실시하여 본 정책의 준수를 강조하고 있습니다.
          - 나. “회사”는 이용자의 개인적인 부주의로 아이디, 비밀번호 등 개인정보가 유출되어 발생한 문제와 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다. 이용자의 아이디와 비밀번호는 반드시 본인만 사용하고, 비밀번호를 자주 변경하며, 공용PC에서의 로그인시 개인정보가 유출되지 않도록 각별한 주의를 기울여 주시기 바랍니다.

          **제12조 (개인정보 보호책임자 및 상담·신고)**

          “회사”는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만 및 문의를 처리하기 위하여 아래와 같이 개인정보 보호 책임자를 지정하고 있습니다. 이용자는 “회사”의 서비스를 이용하며 발생하는 모든 개인정보보호 관련 민원을 개인정보보호책임자 또는 담당 부서로 신고할 수 있으며, “회사”는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.

          - 개인정보 열람청구 접수 및 처리 부서
              - 담당부서: 고객센터
              - 이메일 : readywhistle@gmail.com

          **제13조 (권익침해 구제방법)**

          정보주체는 개인정보침해로 인한 구제를 받기 위하여 개인정보분쟁조정위원회, 한국인터넷진흥원 개인정보침해신고센터 등에 분쟁해결이나 상담 등을 신청할 수 있습니다. 이 밖에 기타 개인정보침해의 신고, 상담에 대하여는 아래 기관에 문의하시기 바랍니다.

          - 개인정보분쟁조정위원회 : (국번없이) 1833-697ㅣ [www.kopico.go.kr](http://www.kopico.go.kr/)

          - 개인정보침해신고센터 : (국번없이) 118 ㅣ [privacy.kisa.or.kr](http://privacy.kisa.or.kr/)

          - 대검찰청 첨단범죄수사과 : (국번없이) 1301 ㅣ [www.spo.go.kr](http://www.spo.go.kr/)

          - 경찰청 사이버안전지킴이 : (국번없이) 182 ㅣ [ecrm.cyber.go.kr](http://ecrm.cyber.go.kr/)

          **제14조**

          “회사”는 이용자에게 다른 외부사이트로 연결되는 링크를 제공할 수 있습니다. 이 경우 “회사”는 외부사이트에 대한 통제권이 없으므로 이용자가 외부사이트로 제공받는 서비스나 자료의 유용성, 진실성, 적법성에 대해 책임 및 보증할 수 없습니다. 본 개인정보처리방침은 링크된 외부사이트(“회사”가 운영하지 않는 웹사이트를 말합니다.)에서는 적용되지 않으며, 링크된 외부사이트의 개인정보처리방침은 “회사”와 무관하므로 해당 외부사이트의 정책을 확인하시기 바랍니다.

          **제15조 (개인정보처리방침 변경)**

          ① 회사가 개인정보처리방침을 변경하는 경우에는 변경 및 시행의 시기, 변경된 내용을 지속적으로 공개하며, 변경된 내용은 이용자가 쉽게 확인할 수 있도록 변경 전·후를 비교하여 공개합니다.

          ② 회사의 개인정보처리방침은 정부의 법률 및 지침 변경이나 회사의 내부 방침 변경 등으로 인하여 수시로 변경될 수 있고, 이에 따른 개인정보처리방침의 지속적인 개선을 위하여 필요한 절차를 정하고 있습니다. 개인정보처리방침이 변경될 경우 회사의 사이트 내 공지사항을 통하여 고지하고 있습니다. 이용자들께서는 사이트 방문 시 수시로 확인하시기 바랍니다.

          부칙

          본 개인정보처리방침은 2023년 9월 20일부터 적용됩니다.
          """
        }
      }
      .padding(.horizontal, 16)
      .lineSpacing(10)
    }
    .navigationTitle("개인정보 처리 방침")
  }
}

#Preview {
  NavigationStack {
    PrivacyPolicyView()
  }
}
